Autodesk.Revit.DB.KeynoteEntry.#ctor(System.String,System.String)
Constructs a new KeynoteEntry from the given
key name and keynote text. KeynoteEntry objects
created from this constructor will not have parents.
key:
The key of this KeynoteEntry
text:
The text associated with this KeynoteEntry
Throws Autodesk.Revit.Exceptions.ArgumentException:
key is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.KeynoteEntry.#ctor(System.String,System.String,System.String)
Constructs a new KeynoteEntry from the given
key name, parent key name, and keynote text.
key:
The key of this KeynoteEntry.
parentKey:
The parent key of this KeynoteEntry.
Empty string means this KeynoteEntry does not have a parent.
text:
The text associated with this KeynoteEntry
Throws Autodesk.Revit.Exceptions.ArgumentException:
key is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015